content/projects/index.md
+++
weight = 0
title = "projects and ideas"
author = ["Soc Virnyl Estela"]
date = 2023-07-09
tags = ["projects", "ideas"]
draft = false
[taxonomies]
  tags = ["projects", "ideas"]
+++

I put all my projects and ideas here. They are either dead or active. Mostly dead to be
honest.


## Rypper {#rypper}

[rypper](https://rypper.uncomfyhalomacro.pl) is a package manager written in [Rust](https://rust-lang.org) with the goal of being an alternative package
manager for [openSUSE](https://get.opensuse.org). It may work with other RPM-based distributions. As it stands, it is still
a _**work in progress**_. I consider this project to be active development.


## Waylight {#waylight}

[waylight](https://github.com/waycrate/waylight) is a brightness and gamma control tool for X11 and Wayland. The goal of this project
is to allow me to learn [Zig](https://ziglang.org). This may also let me understand how udev and sysfs stuffs work on
Linux.


## SBOL3.jl {#sbol3-dot-jl}

[SBOL3.jl](https://github.com/uncomfyhalomacro/SBOL3.jl) is a [Julia](https://julialang.org) project of mine that I postponed because of my lack of time to understand
and create a multiple dispatch equivalent of the OOP nature of the [SBOL3](https://sbolstandard.org/) specification. I have an
idea on how to approach it now. I will probably resume writing it once I got my ideas clearly.
